using System;
using System.Collections.Generic;
using System.Text;

namespace txt_manager
{
    public class ASII_transliteration
    {
        // ----------------------- Таблица символов ASII для транслитерации------------------------------
        // Примечание. Используется для написания русских слов латинскими буквами.
       public byte[] ASII_translate = {
0   ,//	0	Нулевой байт
1   ,//	1	Начало заголовка
2   ,//	2	Начало текста
3   ,//	3	Конец «текста»
4   ,//	4	конец передачи
5   ,//	5	«Прошу подтверждения!»
6   ,//	6	«Подтверждаю!»
7   ,//	7	Звуковой сигнал – звонок
8   ,//	8	Возврат на один символ (BACKSPACE)
9   ,//	9	Табуляция
10  ,//	10	Перевод строки
11  ,//	11	Вертикальная табуляция
12  ,//	12	Прогон страницы, новая страница
13  ,//	13	Возврат каретки
14  ,//	14	Переключиться на другую ленту (кодировку)
15  ,//	15	Переключиться на исходную ленту (кодировку)
16  ,//	16	Экранирование канала данных
17  ,//	17	1-й символ управления устройством
18  ,//	18	2-й символ управления устройством
19  ,//	19	3-й символ управления устройством
20  ,//	20	4-й символ управления устройством
21  ,//	21	«Не подтверждаю!»
22  ,//	22	Символ для синхронизации
23  ,//	23	Конец текстового блока
24  ,//	24	Отмена
25  ,//	25	Конец носителя
26  ,//	26	Подставить
27  ,//	27	Escape (Расширение)
28  ,//	28	Разделитель файлов
29  ,//	29	Разделитель групп
30  ,//	30	Разделитель записей
31  ,//	31	Разделитель юнитов
32  ,//	32	Пробел
33  ,//	33	!
34  ,//	34	"
35  ,//	35	#
36  ,//	36	$
37  ,//	37	%
38  ,//	38	&
39  ,//	39	'
40  ,//	40	(
41  ,//	41	)
42  ,//	42	*
43  ,//	43	+
44  ,//	44	,
45  ,//	45	-
46  ,//	46	.
47  ,//	47	/
48  ,//	48	0
49  ,//	49	1
50  ,//	50	2
51  ,//	51	3
52  ,//	52	4
53  ,//	53	5
54  ,//	54	6
55  ,//	55	7
56  ,//	56	8
57  ,//	57	9
58  ,//	58	:
59  ,//	59	;
60  ,//	60	<
61  ,//	61	=
62  ,//	62	>
63  ,//	63	?
64  ,//	64	@
65  ,//	65	A
66  ,//	66	B
67  ,//	67	C
68  ,//	68	D
69  ,//	69	E
70  ,//	70	F
71  ,//	71	G
72  ,//	72	H
73  ,//	73	I
74  ,//	74	J
75  ,//	75	K
76  ,//	76	L
77  ,//	77	M
78  ,//	78	N
79  ,//	79	O
80  ,//	80	P
81  ,//	81	Q
82  ,//	82	R
83  ,//	83	S
84  ,//	84	T
85  ,//	85	U
86  ,//	86	V
87  ,//	87	W
88  ,//	88	X
89  ,//	89	Y
90  ,//	90	Z
91  ,//	91	[
92  ,//	92	\
93  ,//	93	]
94  ,//	94	^
95  ,//	95	_
96  ,//	96	`
97  ,//	97	a
98  ,//	98	b
99  ,//	99	c
100 ,//	100	d
101 ,//	101	e
102 ,//	102	f
103 ,//	103	g
104 ,//	104	h
105 ,//	105	i
106 ,//	106	j
107 ,//	107	k
108 ,//	108	l
109 ,//	109	m
110 ,//	110	n
111 ,//	111	o
112 ,//	112	p
113 ,//	113	q
114 ,//	110	r
115 ,//	115	s
116 ,//	116	t
117 ,//	117	u
118 ,//	118	v
119 ,//	119	w
120 ,//	120	x
121 ,//	121	y
122 ,//	122	z
123 ,//	123	{
124 ,//	124	|
125 ,//	125	}
45 ,//	126	~
127 ,//	127	Delete
128 ,//	128	Ђ
129 ,//	129	Ѓ
130 ,//	130	‚
131 ,//	131	ѓ
 34 ,//	132	„
 46 ,//	133	…  // - замена многоточия на точку
134 ,//	134	†
135 ,//	135	‡
136 ,//	136	€
137 ,//	137	‰
138 ,//	138	Љ
139 ,//	139	‹
140 ,//	140	Њ
141 ,//	141	Ќ
142 ,//	142	Ћ
143 ,//	143	Џ
144 ,//	144	Ђ
145 ,//	145	‘
146 ,//	146	’
 34 ,//	147	“
 34 ,//	148	”
149 ,//	149	•
45 ,//	150	–
45 ,//	151	—
152 ,//	152	Начало строки
153 ,//	153	™
154 ,//	154	љ
155 ,//	155	›
156 ,//	156	њ
157 ,//	157	ќ
158 ,//	158	ћ
159 ,//	159	џ
160 ,//	160	Неразрывный пробел
161 ,//	161	Ў
162 ,//	162	ў
163 ,//	163	Ј
164 ,//	164	¤
165 ,//	165	Ґ
166 ,//	166	¦
167 ,//	167	§
89 ,//	168	Ё
169 ,//	169	©
170 ,//	170	Є
171 ,//	171	«
172 ,//	172	¬
173 ,//	173	Мягкий перенос
174 ,//	174	®
175 ,//	175	Ї    
176 ,//	176	°
177 ,//	177	±
178 ,//	178	І
179 ,//	179	і
180 ,//	180	ґ
181 ,//	181	µ
182 ,//	182	¶
183 ,//	183	·
121 ,//	184	ё
185 ,//	185	№
186 ,//	186	є
187 ,//	187	»
188 ,//	188	ј
189 ,//	189	Ѕ
190 ,//	190	ѕ
191 ,//	191	ї
65 ,//	192	А
66 ,//	193	Б
86 ,//	194	В
71 ,//	195	Г
68 ,//	196	Д
69 ,//	197	Е
90 ,//	198	Ж
90 ,//	199	З
73 ,//	200	И
74 ,//	201	Й
75 ,//	202	К
76 ,//	203	Л
77 ,//	204	М
78 ,//	205	Н
79 ,//	206	О
80 ,//	207	П
82 ,//	208	Р
83 ,//	209	С
84 ,//	210	Т
85 ,//	211	У
70 ,//	212	Ф
72 ,//	213	Х
67 ,//	214	Ц
67 ,//	215	Ч
83 ,//	216	Ш
83 ,//	217	Щ
34 ,//	218	Ъ
89 ,//	219	Ы
39 ,//	220	Ь
69 ,//	221	Э
89 ,//	222	Ю
89 ,//	223	Я
97 ,//	224	а
98 ,//	225	б
118 ,//	226	в
103 ,//	227	г
100 ,//	228	д
101 ,//	229	е
122 ,//	230	ж
122 ,//	231	з
105 ,//	232	и
106 ,//	233	й
107 ,//	234	к
108 ,//	235	л
109 ,//	236	м
110 ,//	237	н
111 ,//	238	о
112 ,//	239	п
114 ,//	240	р
115 ,//	241	с
116 ,//	242	т
117 ,//	243	у
102 ,//	244	ф
104 ,//	245	х
99 ,//	246	ц
99 ,//	247	ч
115 ,//	248	ш
115 ,//	249	щ
34 ,//	250	ъ
121 ,//	251	ы
39 ,//	252	ь
101 ,//	253	э
121 ,//	254	ю
121 //	255	я 
};
        // ----------------------- Функция для транслитерация ГОСТ 7.79-2000----------------------------
        // Написанме русского текста латинским алфавитом. ГОСТ 7.79-2000
 public string transliton(string txt)
        {
            byte[] bytes = Encoding.Default.GetBytes(txt);
            string exit = "";
            for (int i = 0; i < txt.Length; i++)// - перебор текста и подмена символов
            {
                exit += Convert.ToChar(ASII_translate[bytes[i]]);
                if (bytes[i] == 168 || bytes[i] == 184) { exit += Convert.ToChar(ASII_translate[111]); } // - Ё(Yo),ё(yo)
                if (bytes[i] == 198 || bytes[i] == 230) { exit += Convert.ToChar(ASII_translate[104]); } // - Ж(Zh),ж(zh)
                if (bytes[i] == 215 || bytes[i] == 247) { exit += Convert.ToChar(ASII_translate[104]); } // - Ч(Ch),ч(ch)
                if (bytes[i] == 216 || bytes[i] == 248) { exit += Convert.ToChar(ASII_translate[104]); } // - Ш(Sh),ш(sh)
                if (bytes[i] == 217 || bytes[i] == 249) { exit += Convert.ToChar(ASII_translate[104]); exit += Convert.ToChar(ASII_translate[104]); } // - Щ(Shh),щ(shh)
                if (bytes[i] == 222 || bytes[i] == 254) { exit += Convert.ToChar(ASII_translate[117]); } // - Ю(Yu),ю(yo)
                if (bytes[i] == 223 || bytes[i] == 255) { exit += Convert.ToChar(ASII_translate[97]); }  // - Я(Ya)я,(ya)
            }
            return exit;
         }
   }
}
