using System;
using System.Collections.Generic;
using System.Text;

 namespace txt_manager
{
    public class ASII
    {

        // ---------------------------------- Таблица символов ASII ---------------------------------
        // Примечание. Используется для подмены символов. 
      public  byte[] ASII_table = { 0   ,//	0	Нулевой байт
1   ,//	1	Начало заголовка
2   ,//	2	Начало текста
3   ,//	3	Конец «текста»
4   ,//	4	конец передачи
5   ,//	5	«Прошу подтверждения!»
6   ,//	6	«Подтверждаю!»
7   ,//	7	Звуковой сигнал – звонок
8   ,//	8	Возврат на один символ (BACKSPACE)
9   ,//	9	Табуляция
10  ,//	10	Перевод строки
11  ,//	11	Вертикальная табуляция
12  ,//	12	Прогон страницы, новая страница
13  ,//	13	Возврат каретки
14  ,//	14	Переключиться на другую ленту (кодировку)
15  ,//	15	Переключиться на исходную ленту (кодировку)
16  ,//	16	Экранирование канала данных
17  ,//	17	1-й символ управления устройством
18  ,//	18	2-й символ управления устройством
19  ,//	19	3-й символ управления устройством
20  ,//	20	4-й символ управления устройством
21  ,//	21	«Не подтверждаю!»
22  ,//	22	Символ для синхронизации
23  ,//	23	Конец текстового блока
24  ,//	24	Отмена
25  ,//	25	Конец носителя
26  ,//	26	Подставить
27  ,//	27	Escape (Расширение)
28  ,//	28	Разделитель файлов
29  ,//	29	Разделитель групп
30  ,//	30	Разделитель записей
31  ,//	31	Разделитель юнитов
32  ,//	32	Пробел
33  ,//	33	!
34  ,//	34	"
35  ,//	35	#
36  ,//	36	$
37  ,//	37	%
38  ,//	38	&
39  ,//	39	'
40  ,//	40	(
41  ,//	41	)
42  ,//	42	*
43  ,//	43	+
44  ,//	44	,
45  ,//	45	-
46  ,//	46	.
47  ,//	47	/
48  ,//	48	0
49  ,//	49	1
50  ,//	50	2
51  ,//	51	3
52  ,//	52	4
53  ,//	53	5
54  ,//	54	6
55  ,//	55	7
56  ,//	56	8
57  ,//	57	9
58  ,//	58	:
59  ,//	59	;
60  ,//	60	<
61  ,//	61	=
62  ,//	62	>
63  ,//	63	?
64  ,//	64	@
65  ,//	65	A
66  ,//	66	B
67  ,//	67	C
68  ,//	68	D
69  ,//	69	E
70  ,//	70	F
71  ,//	71	G
72  ,//	72	H
73  ,//	73	I
74  ,//	74	J
75  ,//	75	K
76  ,//	76	L
77  ,//	77	M
78  ,//	78	N
79  ,//	79	O
80  ,//	80	P
81  ,//	81	Q
82  ,//	82	R
83  ,//	83	S
84  ,//	84	T
85  ,//	85	U
86  ,//	86	V
87  ,//	87	W
88  ,//	88	X
89  ,//	89	Y
90  ,//	90	Z
91  ,//	91	[
92  ,//	92	\
93  ,//	93	]
94  ,//	94	^
95  ,//	95	_
96  ,//	96	`
97  ,//	97	a
98  ,//	98	b
99  ,//	99	c
100 ,//	100	d
101 ,//	101	e
102 ,//	102	f
103 ,//	103	g
104 ,//	104	h
105 ,//	105	i
106 ,//	106	j
107 ,//	107	k
108 ,//	108	l
109 ,//	109	m
110 ,//	110	n
111 ,//	111	o
112 ,//	112	p
113 ,//	113	q
114 ,//	114	r
115 ,//	115	s
116 ,//	116	t
117 ,//	117	u
118 ,//	118	v
119 ,//	119	w
120 ,//	120	x
121 ,//	121	y
122 ,//	122	z
123 ,//	123	{
124 ,//	124	|
125 ,//	125	}
45 ,//	126	~
127 ,//	127	Delete
128 ,//	128	Ђ
129 ,//	129	Ѓ
130 ,//	130	‚
131 ,//	131	ѓ
132 ,//	132	„  
133 ,//	133	…  // - замена многоточия на точку
134 ,//	134	†
135 ,//	135	‡
136 ,//	136	€
137 ,//	137	‰
138 ,//	138	Љ
139 ,//	139	‹
140 ,//	140	Њ
141 ,//	141	Ќ
142 ,//	142	Ћ
143 ,//	143	Џ
144 ,//	144	Ђ
145 ,//	145	‘
146 ,//	146	’
 34 ,//	147	“
 34 ,//	148	”
149 ,//	149	•
 45 ,//	150	–  замена длинного тире на минус
 45 ,//	151	—  замена длинного тире на минус
152 ,//	152	Начало строки
153 ,//	153	™
154 ,//	154	љ
155 ,//	155	›
156 ,//	156	њ
157 ,//	157	ќ
158 ,//	158	ћ
159 ,//	159	џ
160 ,//	160	Неразрывный пробел
161 ,//	161	Ў
162 ,//	162	ў
163 ,//	163	Ј
164 ,//	164	¤
165 ,//	165	Ґ
166 ,//	166	¦
167 ,//	167	§
168 ,//	168	Ё
169 ,//	169	©
170 ,//	170	Є
171 ,//	171	«
172 ,//	172	¬
173 ,//	173	Мягкий перенос
174 ,//	174	®
175 ,//	175	Ї    176 символ заменён на 175, выводит знак градуса (для дисплея LC7981)
176 ,//	176	°
149 ,//	177	±
178 ,//	178	І
179 ,//	179	і
180 ,//	180	ґ
181 ,//	181	µ
182 ,//	182	¶
183 ,//	183	·
184 ,//	184	ё
185 ,//	185	№
186 ,//	186	є
187 ,//	187	»
188 ,//	188	ј
189 ,//	189	Ѕ
190 ,//	190	ѕ
191 ,//	191	ї
192 ,//	192	А
193 ,//	193	Б
194 ,//	194	В
195 ,//	195	Г
196 ,//	196	Д
197 ,//	197	Е
198 ,//	198	Ж
199 ,//	199	З
200 ,//	200	И
201 ,//	201	Й
202 ,//	202	К
203 ,//	203	Л
204 ,//	204	М
205 ,//	205	Н
206 ,//	206	О
207 ,//	207	П
208 ,//	208	Р
209 ,//	209	С
210 ,//	210	Т
211 ,//	211	У
212 ,//	212	Ф
213 ,//	213	Х
214 ,//	214	Ц
215 ,//	215	Ч
216 ,//	216	Ш
217 ,//	217	Щ
218 ,//	218	Ъ
219 ,//	219	Ы
220 ,//	220	Ь
221 ,//	221	Э
222 ,//	222	Ю
223 ,//	223	Я
224 ,//	224	а
225 ,//	225	б
226 ,//	226	в
227 ,//	227	г
228 ,//	228	д
229 ,//	229	е
230 ,//	230	ж
231 ,//	231	з
232 ,//	232	и
233 ,//	233	й
234 ,//	234	к
235 ,//	235	л
236 ,//	236	м
237 ,//	237	н
238 ,//	238	о
239 ,//	239	п
240 ,//	240	р
241 ,//	241	с
242 ,//	242	т
243 ,//	243	у
244 ,//	244	ф
245 ,//	245	х
246 ,//	246	ц
247 ,//	247	ч
248 ,//	248	ш
249 ,//	249	щ
250 ,//	250	ъ
251 ,//	251	ы
252 ,//	252	ь
253 ,//	253	э
254 ,//	254	ю
255 //	255	я 
                            };

    }
}
